{
  "reviews": [
    {
      "id": 1,
      "name": "Priya Sharma",
      "rating": 5,
      "review": "Unlocked Coding transformed my career! The comprehensive courses and practical projects helped me land my dream job at Google. The instructors are amazing and the content is top-notch.",
      "course": "Full Stack Development",
      "location": "Mumbai, Maharashtra"
    },
    {
      "id": 2,
      "name": "Arjun Patel",
      "rating": 5,
      "review": "Best platform for learning DSA and system design. The structured approach and real-world examples made complex concepts easy to understand. Highly recommended!",
      "course": "Data Structures & Algorithms",
      "location": "Bangalore, Karnataka"
    },
    {
      "id": 3,
      "name": "Sneha Reddy",
      "rating": 5,
      "review": "The machine learning course is exceptional! From basics to advanced concepts, everything is explained clearly. The hands-on projects gave me confidence to work on real ML problems.",
      "course": "Machine Learning",
      "location": "Hyderabad, Telangana"
    },
    {
      "id": 4,
      "name": "Rahul Kumar",
      "rating": 5,
      "review": "Unlocked Coding helped me transition from a non-tech background to becoming a successful software engineer. The community support and mentorship are incredible.",
      "course": "Web Development",
      "location": "Delhi, NCR"
    },
    {
      "id": 5,
      "name": "Ananya Singh",
      "rating": 4,
      "review": "The system design course is a game-changer! The detailed explanations and case studies helped me crack senior-level interviews. Worth every minute spent learning.",
      "course": "System Design",
      "location": "Pune, Maharashtra"
    },
    {
      "id": 6,
      "name": "Vikram Joshi",
      "rating": 5,
      "review": "Amazing platform with quality content! The instructors are industry experts who know exactly what companies look for. The course structure is perfect for working professionals.",
      "course": "DevOps & Cloud",
      "location": "Chennai, Tamil Nadu"
    },
    {
      "id": 7,
      "name": "Kavya Nair",
      "rating": 5,
      "review": "The React and Node.js course is outstanding! The projects are industry-relevant and the code reviews helped me improve my coding standards significantly.",
      "course": "MERN Stack",
      "location": "Kochi, Kerala"
    },
    {
      "id": 8,
      "name": "Rohit Agarwal",
      "rating": 5,
      "review": "Unlocked Coding is the best investment I made for my career. The comprehensive curriculum and practical approach helped me land multiple job offers.",
      "course": "Java Full Stack",
      "location": "Gurgaon, Haryana"
    },
    {
      "id": 9,
      "name": "Meera Iyer",
      "rating": 5,
      "review": "The data engineering course is fantastic! The real-world projects and industry insights gave me the skills needed to excel in my current role.",
      "course": "Data Engineering",
      "location": "Ahmedabad, Gujarat"
    },
    {
      "id": 10,
      "name": "Suresh Gupta",
      "rating": 5,
      "review": "Excellent platform with world-class instructors! The course materials are up-to-date and the support team is always helpful. Highly recommend to anyone serious about learning programming.",
      "course": "Python Development",
      "location": "Jaipur, Rajasthan"
    }
  ],
  "averageRating": 4.95,
  "totalReviews": 1250
}
