{
  "id": "harkirat-singh",
  "name": "Harkirat Singh",
  "displayName": "Harkirat-Singh",
  "bio": "Harkirat Singh is an accomplished full-stack engineer, tech entrepreneur, and educator renowned for building modern web applications and mentoring developers through practical, hands-on cohorts. As the founder of 100xDevs, Harkirat has revolutionized developer education by creating immersive, project-based learning experiences that take students from beginner to job-ready in full-stack development. His teaching philosophy emphasizes building real-world applications, understanding system design principles, and mastering modern web technologies. With extensive experience at top tech companies, Harkirat brings industry insights and best practices to his cohorts, helping thousands of students land their dream jobs in web development. The 100xDevs initiative represents Harkirat's vision of democratizing high-quality tech education and making world-class developer training accessible to students regardless of their background or financial situation. Through his innovative cohort-based learning model, Harkirat has created a community-driven educational experience that goes far beyond traditional online courses. Each cohort is carefully structured to simulate real-world development workflows, with students working on actual projects, collaborating with peers, and receiving personalized mentorship from experienced industry professionals. Harkirat's courses cover the entire full-stack development spectrum, from fundamental concepts like HTML, CSS, and JavaScript to advanced topics including React, Node.js, databases, authentication, deployment, and system design. His curriculum is constantly updated to reflect the latest industry trends and technologies, ensuring that students learn skills that are immediately relevant in today's job market. What makes Harkirat's teaching particularly effective is his focus on building complete, production-ready applications rather than isolated code snippets. Students in his cohorts work on multiple projects throughout the program, each one increasing in complexity and introducing new concepts and technologies. This progressive learning approach ensures that students develop both theoretical understanding and practical skills simultaneously. Harkirat's expertise in system design is a standout feature of his teaching. He helps students understand how to architect scalable applications, design efficient database schemas, implement proper authentication and authorization, and deploy applications to production environments. His system design sessions are renowned for breaking down complex architectural decisions into understandable components, helping students think like senior engineers. Beyond technical skills, Harkirat places strong emphasis on developer best practices, code quality, testing, version control, and collaboration. He teaches students how to write clean, maintainable code, conduct code reviews, work with Git and GitHub effectively, and collaborate in team environments using industry-standard tools and workflows. The community aspect of 100xDevs is another key differentiator. Harkirat has fostered a supportive learning environment where students help each other, share resources, celebrate successes, and work through challenges together. This sense of community has been instrumental in helping many students stay motivated and complete the rigorous program. Harkirat's open-source contributions and commitment to transparency in education have made him a respected figure in the developer community. He regularly shares insights about the tech industry, career development, and the skills that matter most for aspiring developers. His honest and practical advice has helped thousands of students make informed decisions about their learning paths and career goals. The success stories from Harkirat's cohorts speak volumes about the effectiveness of his teaching approach. Many graduates have secured positions at top tech companies, startups, and have even started their own successful ventures. The comprehensive nature of his curriculum, combined with his industry experience and dedication to student success, makes Harkirat one of the most effective and impactful educators in the field of full-stack web development. One of the unique aspects of Harkirat's teaching is his emphasis on building real-world projects that students can showcase in their portfolios. Throughout the cohort program, students build multiple applications including e-commerce platforms, social media apps, payment systems, and more. These projects are not just simple tutorials but complete applications with proper architecture, error handling, testing, and deployment. This portfolio-building approach helps students stand out in job interviews and demonstrates their ability to build production-ready applications. Harkirat's expertise extends to modern web technologies including TypeScript, GraphQL, WebSockets, and microservices architecture. He teaches students how to use these technologies effectively in real-world scenarios, ensuring they stay current with industry trends and best practices.",
  "expertise": [
    "Full-Stack Web Development",
    "Backend Engineering",
    "System Design",
    "Developer Mentorship",
    "web3 development"
  ],
  "experience": "5+ years",
  "studentsHelped": "500000+",
  "specialization": "Full-Stack Web Development",
  "teachingStyle": "Hands-on project based learning with open source emphasis and live cohort-structured teaching",
  "achievements": [
    "Founder of the 100xDevs initiative, transforming thousands of developers' careers",
    "Led multiple successful developer bootcamps focused on full-stack and system design",
    "Created comprehensive cohorts covering modern web development technologies and best practices",
    "Helped hundreds of students secure positions at top tech companies and startups"
  ],
  "image": "https://bs-uploads.toptal.io/blackfish-uploads/talent/427843/picture/optimized/huge_c711f787694f240c7bb20e598bfdd6e8-e2b83df354d725bbf11311fddbcf3719.jpg",
  "socialLinks": {
    "youtube": "https://www.youtube.com/@harkirat1",
    "linkedin": "",
    "twitter": "https://twitter.com/kirat_tw",
    "website": ""
  }
}
