{
  "id": "keertipurswani",
  "name": "Keerti Purswani",
  "displayName": "Keerti-Purswani",
  "bio": "Keerti Purswani is a dynamic computer science educator and founder of Educosys, specializing in data structures, algorithms, system design, and generative AI education. With a passion for making complex technical concepts accessible, Keerti has helped thousands of students excel in competitive programming, technical interviews, and real-world software engineering challenges. Her comprehensive approach combines hands-on practice with deep conceptual understanding, preparing students for careers at top tech companies. Keerti's journey in education began with a recognition that many students struggle with the gap between academic computer science and the practical skills required in industry. Having experienced the challenges of technical interviews and competitive programming herself, Keerti understood the need for a learning approach that goes beyond surface-level understanding to build true expertise. This insight led to the creation of Educosys, a platform dedicated to providing comprehensive, industry-relevant computer science education. Keerti's expertise in data structures and algorithms is particularly noteworthy. Her courses cover everything from fundamental data structures like arrays, linked lists, stacks, and queues to advanced topics including trees, graphs, heaps, and hash tables. She teaches not just how to implement these structures, but more importantly, when and why to use each one, helping students develop the intuition needed to solve complex problems efficiently. Her algorithmic thinking courses focus on pattern recognition, problem-solving strategies, and optimization techniques that are essential for technical interviews and competitive programming. Keerti's system design courses are comprehensive and practical, covering both High-Level Design (HLD) and Low-Level Design (LLD). She teaches students how to design scalable systems, handle millions of users, implement efficient caching strategies, manage databases, and ensure system reliability and availability. Her courses include real-world case studies from top tech companies, helping students understand how industry leaders solve complex design challenges. The High-Level Design (HLD) component of Keerti's system design curriculum focuses on architecture, scalability, load balancing, and distributed systems. Students learn to design systems that can handle massive traffic, implement microservices architectures, and make critical design decisions about technology stacks and infrastructure. The Low-Level Design (LLD) portion emphasizes detailed design of components, object-oriented design principles, design patterns, and writing clean, maintainable code. Keerti's innovative approach to teaching generative AI reflects the cutting-edge nature of her curriculum. She helps students understand the fundamentals of machine learning and artificial intelligence, with a particular focus on generative models, natural language processing, and AI application development. Her courses bridge the gap between theoretical AI concepts and practical implementation, enabling students to build real-world AI applications. What sets Keerti apart is her ability to make complex topics accessible without oversimplifying them. She breaks down difficult concepts into digestible parts, uses visual aids and diagrams to illustrate abstract ideas, and provides numerous examples and practice problems to reinforce learning. Her teaching style is interactive and engaging, encouraging students to ask questions and participate actively in the learning process. Keerti's courses are designed with career preparation in mind. She understands that success in technical interviews requires not just knowledge, but also confidence and problem-solving skills. Her interview preparation modules include mock interviews, common interview questions, problem-solving strategies, and tips for communicating technical solutions effectively. Many of her students have successfully secured positions at top tech companies, crediting Keerti's comprehensive preparation for their success. Beyond technical skills, Keerti emphasizes the importance of continuous learning and staying updated with industry trends. She regularly updates her courses to include the latest technologies and best practices, ensuring that students learn skills that are immediately relevant in today's job market. Her commitment to student success extends beyond course delivery, with active community support, doubt-clearing sessions, and personalized mentorship. Keerti's impact on the Indian computer science education landscape is significant. Through Educosys, she has helped thousands of students transform their careers, from struggling with basic concepts to excelling in competitive programming and securing positions at prestigious tech companies. Her dedication to making quality education accessible, combined with her exceptional teaching skills and deep industry knowledge, makes Keerti one of the most respected and effective educators in the field of computer science and software engineering education.",
  "expertise": [
    "Data Structures and Algorithms",
    "System Design (HLD & LLD)",
    "Generative AI & Machine Learning",
    "Competitive Programming",
    "Interview Preparation"
  ],
  "experience": "10+ years",
  "studentsHelped": "50,000+",
  "specialization": "DSA, System Design & AI Education",
  "teachingStyle": "Hands-on project-based learning with live coding sessions, real-world case studies, and comprehensive doubt-clearing support",
  "achievements": [
    "Founder of Educosys, a leading platform for tech education",
    "Created comprehensive courses on DSA, System Design (HLD, LLD, HHLD), and Generative AI",
    "Helped thousands of students secure placements at top tech companies through rigorous interview preparation",
    "Known for breaking down complex algorithms and system design concepts into digestible, practical lessons"
  ],
  "image": "https://media.licdn.com/dms/image/v2/C4D03AQHKMHQDBvQNQA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1646600859438?e=2147483647&v=beta&t=qWVFYtRG-S8aVtWeBJ8g78izae4VRXC79QUCyFC7_UQ",
  "socialLinks": {
    "youtube": "https://www.youtube.com/@Educosys",
    "website": "https://www.educosys.com",
    "linkedin": "https://www.linkedin.com/in/keertipurswani"
  }
}
